Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mfenced Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mfenced ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mfrac Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mfrac ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mglyph Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mglyph ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mi Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mi ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mlabeledtr Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mlabeledtr ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mmultiscripts Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mmultiscripts ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mn Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mn ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mo Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mo ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mover Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mover ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mpadded Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mpadded ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mphantom Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mphantom ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mroot Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mroot ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mrow Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mrow ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/ms Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/ms ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mspace Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mspace ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msqrt Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msqrt ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mstyle Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mstyle ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msub Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msub ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msubsup Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msubsup ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msup Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/msup ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtable Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtable ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtd Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtd ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtext Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/mtext ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/munder Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/munder ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/munderover Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/munderover ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/semantics Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/semantics ソース 編集

source: MathML allows you to draw advanced math on the web, visually similar to Latex math.
ja: MathML は LaTeX で生成した数式と見た目に類似性がある高度な数式の描画をウェブで実現します。

source: Max line length is 80 characters.
ja: 一行あたりの最大文字数は 80 文字までにしてください。

source: May fail with ReplyError or with a socket error.
ja: 失敗時は ReplyError またはソケットエラーになります。

source: May fail with ReplyError Source Edit
ja: 失敗時は ReplyError になります ソース 編集

source: May fail with ReplyError.
ja: 失敗時は ReplyError になります。

source: May return nil.
ja: nil を返します。

source: May throw an IO exception.
ja: IO 例外が投げられます。

source: Meaning
ja: 説明

source: Memory profiler
ja: メモリプロファイラ

source: Memory tracking support for Nim.
ja: Nim のメモリトラッキング・サポートです。

source: Messages may be formed using createMessage by converting the Message into a string.
ja: メッセージは createMessage によりメッセージを文字列に変換することで得られます。

source: Metadata changed.
ja: メタデータが変更された。

source: Minimal output level for the compiler.
ja: コンパイラの最小出力レベル。

source: Miscellaneous
ja: その他

source: Mixin statement
ja: Mixin ステートメント

source: Module for computing MD5 checksums.
ja: MD5 チェックサムの計算で使えるモジュールです。

source: Module scope
ja: モジュールのスコープ

source: Module that implements a fixed length array whose size is determined at runtime.
ja: このモジュールは実行時にサイズが決定される固定長配列の実装です。

source: Modules
ja: モジュール

source: Modules for JS backend
ja: JavaScript バックエンドのモジュール

source: Modules: algorithm, assertions, asyncdispatch, asyncfile, asyncftpclient, asyncfutures, asynchttpserver, asyncjs, asyncmacro, asyncnet, asyncstreams, atomics, base64, bitops, browsers, cgi, chains, channels, colors, compilesettings, complex, cookies, coro, cpuinfo, cpuload, critbits, cstrutils, db_common, db_mysql, db_odbc, db_postgres, db_sqlite, decls, deques, diff, distros, dollars, dom, dynlib, editdistance, encodings, endians, epoll, fenv, hashes, heapqueue, highlite, hotcodereloading, htmlgen, htmlparser, httpclient, httpcore, inotify, intsets, io, iterators, jsconsole, jsffi, json, kqueue, lenientops, lexbase, linenoise, lists, locks, logging, logic, macrocache, macros, marshal, math, md5, memfiles, mersenne, mimetypes, monotimes, nativesockets, net, nimhcr, nimprof, nimscript, nre, oids, options, os, osproc, parsecfg, parsecsv, parsejson, parseopt, parsesql, parseutils, parsexml, pathnorm, pegs, posix_utils, punycode, random, rationals, rdstdin, re, registry, reservedmem, rlocks, ropes, rst, rstast, rstgen, rtarrays, segfaults, selectors, sequtils, sets, sexp, sha1, sharedlist, sharedtables, smtp, ssl_certs, stackframes, stats, streams, strformat, strmisc, strscans, strtabs, strutils, sugar, sums, switch_memory, system, tables, terminal, threadpool, threads, time_t, times, typeinfo, typetraits, underscored_calls, unicode, unidecode, unittest, uri, util, varints, volatile, widestrs, winlean, with, wordwrap, wrapnils, xmlparser, xmltree.
ja: モジュール: algorithm, assertions, asyncdispatch, asyncfile, asyncftpclient, asyncfutures, asynchttpserver, asyncjs, asyncmacro, asyncnet, asyncstreams, atomics, base64, bitops, browsers, cgi, chains, channels, colors, compilesettings, complex, cookies, coro, cpuinfo, cpuload, critbits, cstrutils, db_common, db_mysql, db_odbc, db_postgres, db_sqlite, decls, deques, diff, distros, dollars, dom, dynlib, editdistance, encodings, endians, epoll, fenv, hashes, heapqueue, highlite, hotcodereloading, htmlgen, htmlparser, httpclient, httpcore, inotify, intsets, io, iterators, jsconsole, jsffi, json, kqueue, lenientops, lexbase, linenoise, lists, locks, logging, logic, macrocache, macros, marshal, math, md5, memfiles, mersenne, mimetypes, monotimes, nativesockets, net, nimhcr, nimprof, nimscript, nre, oids, options, os, osproc, parsecfg, parsecsv, parsejson, parseopt, parsesql, parseutils, parsexml, pathnorm, pegs, posix_utils, punycode, random, rationals, rdstdin, re, registry, reservedmem, rlocks, ropes, rst, rstast, rstgen, rtarrays, segfaults, selectors, sequtils, sets, sexp, sha1, sharedlist, sharedtables, smtp, ssl_certs, stackframes, stats, streams, strformat, strmisc, strscans, strtabs, strutils, sugar, sums, switch_memory, system, tables, terminal, threadpool, threads, time_t, times, typeinfo, typetraits, underscored_calls, unicode, unidecode, unittest, uri, util, varints, volatile, widestrs, winlean, with, wordwrap, wrapnils, xmlparser, xmltree.

source: More efficient and simpler than the DOM. It also contains a macro for XML/HTML code generation.
ja: DOM よりも効率的でシンプルです。 XML/HTML コード生成で使えるマクロもあります。

source: More information about its options can be found in the koch documentation.
ja: このツールのオプションに関する詳細情報は koch ドキュメンテーションにあります。

source: Moves a file from source to dest.
ja: ファイルを source から dest へ移動します。

source: Moves the cursor backward by count columns.
ja: 後方向へカーソルを count 桁移動します。

source: Moves the cursor down by count rows.
ja: 下方向へカーソルを count 行移動します。

source: Moves the cursor forward by count columns.
ja: 前方向へカーソルを count 桁移動します。

source: Moves the cursor up by count rows.
ja: 上方向へカーソルを count 行移動します。

source: Moves the dir from to to.
ja: ディレクトリを from から to へ移動します。

source: Moves the file from to to.
ja: ファイルを from から to へ移動します。

source: Moves.
ja: 移動された。

source: Multi-methods
ja: 多重メソッド

source: Multicast address.
ja: マルチキャストアドレス。

source: Multicast global address.
ja: マルチキャスト方式によるグローバルアドレス。

source: Multicast link-local address.
ja: マルチキャスト方式によるリンク内ローカルアドレス。

source: Multicast node-local address.
ja: マルチキャスト方式によるノード内ローカルアドレス。

source: Multicast organization-local address.
ja: マルチキャスト方式による組織内ローカルアドレス。

source: Multicast site-local address.
ja: マルチキャスト方式によるサイト内ローカルアドレス。

source: Multiline comments
ja: 複数行コメント

source: Multiple binding: load balancing on incoming TCP connections or UDP packets.
ja: 多重バインディング: TCP 接続または UDP パケットの着信に関するロード・バランシング

source: Multiplicative inverse of complex number z.
ja: 複素数 z の逆数です。

source: Multiply x with y.
ja: y で x を乗算します。

source: Multiply y to x.
ja: x に y を乗算します。

source: Multiply a complex number with a real number.
ja: 実数で複素数を乗算します。

source: Multiply a real number and a complex number.
ja: 実数と複素数を乗算します。

source: NULL database values will be converted to nil.
ja: NULL データベース値は nil へ変換されます。

source: Named arguments
ja: 引数の命名

source: Named pipe, or FIFO.
ja: 名前付きパイプ、または FIFO。

source: Namespaces
ja: 名前空間

source: Naming scheme
ja: 命名体系

source: Nanosecond-granularity time of last access.
ja: ナノ秒精度によるデータの最終アクセス時刻。

source: Nanosecond-granularity time of last data modification.
ja: ナノ秒精度によるデータの最終修正時刻。

source: Native code targets
ja: ネイティブコードのターゲット

source: Navigation through the FTP server's directories.
ja: FTP サーバーのディレクトリ移動。

source: Network Programming and Internet Protocols
ja: ネットワークプログラミングとインタープロトコル

source: Never used by PCRE itself Source Edit
ja: Never used by PCRE itself ソース 編集

source: New data is written into the future stream.
ja: 新しいデータを Future ストリームへ書き込むとき。

source: Nil is never returned, but OSError is raised in case of an error.
ja: Nil は返されませんが、この場合のエラーでは OSError が発生します。

source: Nim Compiler User Guide
ja: Nim コンパイラ ユーザガイド

source: Nim DocGen Tools Guide
ja: Nim DocGen ツールガイド

source: Nim Documentation Overview
ja: Nim ドキュメンテーションの概要

source: Nim Enhancement Proposal #1 - Standard Library Style Guide
ja: Nim 拡張提案書 #1 - 標準ライブラリのスタイルガイド

source: Nim Manual
ja: Nim マニュアル

source: Nim OID support.
ja: Nim におけるオブジェクトID のサポートです。

source: Nim Standard Library
ja: Nim 標準ライブラリ

source: Nim Tutorial (Part I)
ja: Nim チュートリアル（第１部）

source: Nim Tutorial (Part III)
ja: チュートリアル（第３部）

source: Nim comes with a platform independent profiler - the Embedded Stack Trace Profiler (ESTP).
ja: Nim にはプラットホームに依存しないプロファイラ － 組み込みスタックトレースプロファイラ (ESTP) の機能があります。

source: Nim condition variable Source Edit
ja: Nim の状態変数です ソース 編集

source: Nim coroutines implementation, supports several context switching methods:
ja: 各種コンテキスト・スイッチのメソッドをサポートした Nim のコルーチン実装です。

source: Nim currently generates async/await JavaScript code which is supported in modern EcmaScript and most modern versions of browsers, Node.js and Electron.
ja: Nim における現在の実装で生成される async/await JavaScript コードは最新の EcmaScript と最新版のウェブ・ブラウザ、 Node.js と Electron をサポートしています。

source: Nim file input
ja: Nim ファイルの入力

source: Nim is a compiled, garbage-collected systems programming language which has an excellent productivity/performance ratio.
ja: Nim は優れた生産性と実行効率があるコンパイル型、ガベージコレクタに対応したシステムプログラミング言語です。

source: Nim is a new statically typed, imperative programming language, that supports procedural, functional, object oriented and generic programming styles while remaining simple and efficient.
ja: Nim は新しい静的型付けによる命令型プログラミング言語です。シンプルさを残したまま効率性的なスタイルによる手続き型、関数型、オブジェクト指向プログラミングをサポートしています。

source: Nim is free software; it is licensed under the MIT License.
ja: Nim は MIT ライセンスのフリーソフトウェアです。

source: Nim lock, re-entrant Source Edit
ja: 再入可能な Nim のロックです ソース 編集

source: Nim lock; whether this is re-entrant or not is unspecified!
ja: Nim のロックです。これは再入可能、または未指定であるかどうかの判定に使います！

source: Nim maintenance script
ja: Nim メンテナンス・スクリプト

source: Nim runs on a wide variety of platforms.
ja: Nim は多種多様なプラットホームで動作します。

source: Nim search and replace utility.
ja: Nim 製の検索と置換ユーティリティです。

source: Nim uses the classic compiler architecture: A lexer/scanner feds tokens to a parser.
ja: Nim は古典的コンパイラのアーキテクチャを採用しています: 字句解析器やスキャナのトークンをパーサへ渡します。

source: Nim versions before 0.20 used the wrong spelling ("demon").
ja: Nim バージョン 0.20 以前ではスペル ("demon") が誤ったまま使われていました。

source: Nim's Memory Management
ja: Nim のメモリ管理

source: Nim's design focuses on the 3E: efficiency, expressiveness, elegance (in the order of priority).""" App: Console License: "copying.txt" [Config] Files: "config/nim.cfg" Files: "config/nimdoc.cfg" Files: "config/nimdoc.tex.cfg" [Documentation] ; Files: "doc/*.html" ; Files: "doc/*.cfg" ; Files: "doc/*.pdf" ; Files: "doc/*.ini" Files: "doc/html/overview.html" Start: "doc/html/overview.html" [Other] Files: "copying.txt" Files: "koch.nim" Files: "icons/nim.ico" Files: "icons/nim.rc" Files: "icons/nim.res" Files: "icons/nim_icon.o" Files: "icons/koch.ico" Files: "icons/koch.rc" Files: "icons/koch.res" Files: "icons/koch_icon.o" Files: "compiler" Files: "doc" Files: "doc/html" Files: "tools" Files: "tools/nim-gdb.py" Files: "nimpretty" Files: "testament" Files: "nimsuggest" Files: "nimsuggest/tests/*.nim" [Lib] Files: "lib" [Other] Files: "examples" Files: "dist/nimble" Files: "tests" [Windows] Files: "bin/nim.exe" Files: "bin/nimgrep.exe" Files: "bin/nimsuggest.exe" Files: "bin/nimble.exe" Files: "bin/vccexe.exe" Files: "bin/nimgrab.exe" Files: "bin/nimpretty.exe" Files: "bin/testament.exe" Files: "koch.exe" Files: "finish.exe" ; Files: "bin/downloader.exe" ; Files: "dist/mingw" Files: r"tools\start.bat" BinPath: r"bin;dist\mingw\bin;dist" ; Section | dir | zipFile | size hint (in KB) | url | exe start menu entry Download: r"Documentation|doc|docs.zip|13824|https://nim-lang.org/download/docs-${version}.zip|overview.html" Download: r"C Compiler (MingW)|dist|mingw.zip|82944|https://nim-lang.org/download/${mingw}.zip" Download: r"Support DLLs|bin|nim_dlls.zip|479|https://nim-lang.org/download/dlls.zip" Download: r"Aporia Text Editor|dist|aporia.zip|97997|https://nim-lang.org/download/aporia-0.4.0.zip|aporia-0.4.0\bin\aporia.exe" ; for now only NSIS supports optional downloads [WinBin] Files: "bin/makelink.exe" Files: "bin/7zG.exe" Files: "bin/*.dll" [UnixBin] Files: "bin/nim" [Unix] InstallScript: "yes" UninstallScript: "yes" [InnoSetup] path = r"c:\Program Files (x86)\Inno Setup 5\iscc.exe" flags = "/Q" [NSIS] flags = "/V0" [C_Compiler] path = r"" flags = "-w" [deb] buildDepends: "gcc (>= 4:4.3.2)" pkgDepends: "gcc (>= 4:4.3.2)" shortDesc: "The Nim Compiler" licenses: "bin/nim,MIT;lib/*,MIT;" [nimble] pkgName: "compiler" pkgFiles: "compiler/*;doc/basicopt.txt;doc/advopt.txt;doc/nimdoc.css"
ja: Nim のデザインは 3E に関心を置いています: 経済性 -efficiency-、表現力 -expressiveness-、優美 -elegance- (優先度順)。""" App: Console License: "copying.txt" [Config] Files: "config/nim.cfg" Files: "config/nimdoc.cfg" Files: "config/nimdoc.tex.cfg" [Documentation] ; Files: "doc/*.html" ; Files: "doc/*.cfg" ; Files: "doc/*.pdf" ; Files: "doc/*.ini" Files: "doc/html/overview.html" Start: "doc/html/overview.html" [Other] Files: "copying.txt" Files: "koch.nim" Files: "icons/nim.ico" Files: "icons/nim.rc" Files: "icons/nim.res" Files: "icons/nim_icon.o" Files: "icons/koch.ico" Files: "icons/koch.rc" Files: "icons/koch.res" Files: "icons/koch_icon.o" Files: "compiler" Files: "doc" Files: "doc/html" Files: "tools" Files: "tools/nim-gdb.py" Files: "nimpretty" Files: "testament" Files: "nimsuggest" Files: "nimsuggest/tests/*.nim" [Lib] Files: "lib" [Other] Files: "examples" Files: "dist/nimble" Files: "tests" [Windows] Files: "bin/nim.exe" Files: "bin/nimgrep.exe" Files: "bin/nimsuggest.exe" Files: "bin/nimble.exe" Files: "bin/vccexe.exe" Files: "bin/nimgrab.exe" Files: "bin/nimpretty.exe" Files: "bin/testament.exe" Files: "koch.exe" Files: "finish.exe" ; Files: "bin/downloader.exe" ; Files: "dist/mingw" Files: r"tools\start.bat" BinPath: r"bin;dist\mingw\bin;dist" ; Section | dir | zipFile | size hint (in KB) | url | exe start menu entry Download: r"Documentation|doc|docs.zip|13824|https://nim-lang.org/download/docs-${version}.zip|overview.html" Download: r"C Compiler (MingW)|dist|mingw.zip|82944|https://nim-lang.org/download/${mingw}.zip" Download: r"Support DLLs|bin|nim_dlls.zip|479|https://nim-lang.org/download/dlls.zip" Download: r"Aporia Text Editor|dist|aporia.zip|97997|https://nim-lang.org/download/aporia-0.4.0.zip|aporia-0.4.0\bin\aporia.exe" ; for now only NSIS supports optional downloads [WinBin] Files: "bin/makelink.exe" Files: "bin/7zG.exe" Files: "bin/*.dll" [UnixBin] Files: "bin/nim" [Unix] InstallScript: "yes" UninstallScript: "yes" [InnoSetup] path = r"c:\Program Files (x86)\Inno Setup 5\iscc.exe" flags = "/Q" [NSIS] flags = "/V0" [C_Compiler] path = r"" flags = "-w" [deb] buildDepends: "gcc (>= 4:4.3.2)" pkgDepends: "gcc (>= 4:4.3.2)" shortDesc: "The Nim Compiler" licenses: "bin/nim,MIT;lib/*,MIT;" [nimble] pkgName: "compiler" pkgFiles: "compiler/*;doc/basicopt.txt;doc/advopt.txt;doc/nimdoc.css"

source: Nim's library is divided into pure libraries, impure libraries and wrappers.
ja: Nim のライブラリは純血ライブラリ、混血ライブラリ、およびラッパーに分類されます。

source: Nim's memory model for threads is quite different from other common programming languages (C, Pascal): Each thread has its own (garbage collected) heap and sharing of memory is restricted.
ja: Nim におけるスレッドのメモリモデルは一般的なプログラミング言語 (C, Pascal) とは全く異なるものです。スレッドごとに独立したヒープ (ガベージコレクタ処理可能) はありますが、メモリの共有は制限されています。

source: Nim's parser
ja: Nim のパーサ

source: Nim's standard library only covers the basics, check out https://nimble.directory/ for a list of 3rd party packages.
ja: Nim の標準ライブラリは基本機能のみ網羅しています。サードパーティ製パッケージのリストは https://nimble.directory/ をご確認ください。

source: Nimble metadata.
ja: Nimble のメタデータです。

source: Nimble support: Call this to set the list of requirements of your Nimble package.
ja: Nimble サポート: これは Nimble パッケージの動作要件リストを設定するために呼び出してください。

source: Nimble support: Set this to the package name.
ja: Nimble サポート: これはパッケージ名の設定です。

source: Nimble support: The package's author.
ja: Nimble サポート: パッケージの作者です。

source: Nimble support: The package's backend.
ja: Nimble サポート: パッケージのバックエンドです。

source: Nimble support: The package's binary directory.
ja: Nimble サポート: パッケージのバイナリディレクトリです。

source: Nimble support: The package's description.
ja: Nimble サポート: パッケージの概要です。

source: Nimble support: The package's license.
ja: Nimble サポート: パッケージのライセンスです。

source: Nimble support: The package's source directory.
ja: Nimble サポート: パッケージのソースディレクトリです。

source: Nimble support: The package's version.
ja: Nimble サポート: パッケージのバージョンです。

source: Nimgrep has particularly good support for Nim's eccentric style insensitivity.
ja: Nimgrep の特筆すべき点は Nim のエキセントリック・スタイルの影響を受けないことです。

source: Nimgrep is a command line tool for search&replace tasks.
ja: Nimgrep は検索と置換処理ができるコマンドラインツールです。

source: No <$xml ...$> declaration is produced, so that the produced XML fragments are composable.
ja: <$xml ...$> 宣言は生成されませんが、 XML の断片は構成可能なものとして生成されます。

source: No SIGPIPE generated when an attempt to send is made on a stream-oriented socket that is no longer connected.
ja: 送信を試行するストリーム指向のソケットがもう接続されていないときは SIGPIPE の生成はしません。

source: No guarantees though.
ja: ただし、この定数を用いたバージョンの確認が行われる保証はありません。

source: No longer actually used Source Edit
ja: No longer actually used ソース 編集

source: NoDecl pragma
ja: NoDecl プラグマ

source: Noop unless passing --stacktraceMsgs and --stacktrace Source Edit
ja: --stacktraceMsgs と --stacktrace が渡されない限り処理は行いません ソース 編集

source: Not available for JS backend.
ja: JavaScript バックエンドでは利用できません。

source: Not should be dropped Source Edit
ja: Not should be dropped ソース 編集

source: Note that AssertionError is hidden from the effect system, so it doesn't produce {.raises: [AssertionError].}.
ja: エフェクトシステム側では AssertionError は不可視であるため、 {.raises: [AssertionError].} は生成されないことに注意してください。

source: Note that on Windows this doesn't return the Windows-specific handle, but the C library's notion of a handle, whatever that means.
ja: そのため、 Windows では Windows 固有のハンドルではなく、 C ライブラリにおけるハンドル概念を返すこと注意してください。
